# IFCExtrusionCalculatorOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCalculatorOptions Class
Members See Also
---
This class contains the options used to calculate extrusions from Revit geometry.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class IFCExtrusionCalculatorOptions : IDisposable
```

Visual Basic
---
```text
Public Class IFCExtrusionCalculatorOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCExtrusionCalculatorOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCExtrusionCalculatorOptions
# See Also
IFCExtrusionCalculatorOptions Members
Autodesk.Revit.DB.IFC Namespace